<?php

use Illuminate\Database\Seeder;
use MillionLiveMarketFilter\Idol;

class IdolSeed extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $map = [
            9=>"秋月律子",
            1=>"天海春香",
            16=>"伊吹翼",
            32=>"エミリー",
            40=>"大神環",
            51=>"音無小鳥",
            14=>"春日未来",
            13=>"我那覇響",
            6=>"菊地真",
            2=>"如月千早",
            48=>"北上麗花",
            33=>"北沢志保",
            35=>"木下ひなた",
            29=>"高坂海美",
            19=>"佐竹美奈子",
            8=>"四条貴音",
            45=>"篠宮可憐",
            18=>"島原エレナ",
            50=>"ジュリア",
            49=>"周防桃子",
            5=>"高槻やよい",
            27=>"高山紗代子",
            17=>"田中琴葉",
            31=>"天空橋朋花",
            21=>"徳川まつり",
            20=>"所恵美",
            41=>"豊川風花",
            30=>"中谷育",
            47=>"永吉昴",
            26=>"七尾百合子",
            38=>"二階堂千鶴",
            23=>"野々原茜",
            4=>"萩原雪歩",
            22=>"箱崎星梨花",
            39=>"馬場このみ",
            43=>"福田のり子",
            11=>"双海亜美",
            12=>"双海真美",
            3=>"星井美希",
            34=>"舞浜歩",
            44=>"真壁瑞希",
            28=>"松田亜利沙",
            10=>"三浦あずさ",
            7=>"水瀬伊織",
            42=>"宮尾美也",
            15=>"最上静香",
            24=>"望月杏奈",
            46=>"百瀬莉緒",
            36=>"矢吹可奈",
            37=>"横山奈緒",
            25=>"ロコ",
        ];

        foreach( $map as $key => $value ){
            Idol::unguard();
            Idol::create([
                'id' => $key,
                'idolName' => $value
            ]);
        }
    }
}
